from Article import Article

class Email(Article):
    def color_pair(self):
        return {"text":"WHITE", "back":"BLUE"}

    def get(self):
        return [
                ("Email", "04", "2017-10-19 10:00:00", "てきすとてきすとてきすとてきすと"),
                ("Email", "11", "2017-10-19 10:00:01", "てきすとてきすとてきすとてきすと"),
                ("Email", "16", "2017-10-19 10:00:02", "てきすとてきすとてきすとてきすと"),
                ("Email", "17", "2017-10-19 10:00:03", "てきすとてきすとてきすとてきすと"),
                ("Email", "18", "2017-10-19 10:00:04", "てきすとてきすとてきすとてきすと"),
                ("Email", "19", "2017-10-19 10:00:05", "てきすとてきすとてきすとてきすと"),
                ("Email", "28", "2017-10-19 10:00:09", "てきすとてきすとてきすとてきすと"),
                ("Email", "33", "2017-10-19 10:00:06", "てきすとてきすとてきすとてきすと"),
                ]
